## Apa itu binning
- Binning data atau pengelompokan data adalah proses mengubah data numerik menjadi data kategorikal

### Binning dengan ketentuan sendiri

In [13]:
import pandas as pd
import numpy as np
from sklearn.pipeline import Pipeline

In [14]:
df = pd.read_csv('datasetgaji.csv')
df.head(6)

             Nama Status Rumah  Gaji Orang Tua  Keterangan
0      aldi taher      Kontrak         2100000         NaN
1          kekeyi        Milik         4000000         NaN
2   rangga sasana      Kontrak         1400000         NaN
3  vicky prasetyo      Kontrak          700000         NaN
4            Zuko        Milik          650000         NaN
5           dyrga      Kontrak          450000         NaN

In [15]:
batas_bin = [0, 1300000, 4000000]
kategori = ['Kecil', 'Besar']

In [16]:
df['gaji_binned'] = pd.cut(df['Gaji Orang Tua'], bins=batas_bin, labels=kategori)
df

# untuk melakukan diskritisasi/mengelompokkan data

             Nama Status Rumah  Gaji Orang Tua  Keterangan gaji_binned
0      aldi taher      Kontrak         2100000         NaN       Besar
1          kekeyi        Milik         4000000         NaN       Besar
2   rangga sasana      Kontrak         1400000         NaN       Besar
3  vicky prasetyo      Kontrak          700000         NaN       Kecil
4            Zuko        Milik          650000         NaN       Kecil
5           dyrga      Kontrak          450000         NaN       Kecil